## [prcommenttest](https://danielle.app.spacelift.dev/stack/prcommenttest/run/01HHM93A9HF2EB25MM8RWPVZ05) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HGDN76QHK92ZDA5ZBYGSGJQZ] Planning changes with 0 custom hooks...
data.aws_ami.server_ami: Reading...
data.aws_ami.server_ami: Read complete after 1s [id=ami-0a588942e90cfecc9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.dev_node will be created
  + resource "aws_instance" "dev_node" {
      + ami                                  = "ami-0a588942e90cfecc9"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Environment" = "Dev"
          + "Name"        = "ExampleInstance"
        }
      + tags_all                             = {
          + "Environment" = "Dev"
          + "Name"        = "ExampleInstance"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "315436d8a3399146b37d7460990773856beae69b"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_internet_gateway.mtc_internet_gateway will be created
  + resource "aws_internet_gateway" "mtc_internet_gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "mtc_igw"
        }
      + tags_all = {
          + "Name" = "mtc_igw"
        }
      + vpc_id   = (known after apply)
    }

  # aws_key_pair.mtc_auth will be created
  + resource "aws_key_pair" "mtc_auth" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "mtckey2"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCpyqbN5YjL9KJbjECZ5XabhMdmp/sZOZKkcu7qMtalRDBQU7IHKrgsECXsHSrbmI393VUXgL8qnYMq6XHYVEK8u+D70pXuZaKoTYRyvnwaRbXm324RiyBjInfUVLOGN3x+dkZ2PSSm3G71AVQT6zJVHd2drESyNSYZkITI8XfmuZqTnXOtkfK/cYwnljy4hghN6uC+aTc5F40o8pfXRZMdeE/263pmBtYaWF15/iSp0lO+SAuRYXRevGj0icKLelLSU6X+OrnlVJrxXbxFsfou3CSyY5fN61jSLjQete/O4TLBl0pac5TqBlqUCQQ5kw9OMbk0n47f/jJmn4yQphEbz7Ob0vPm01O+hsLgWpUkrTlROfWy0b9WaoelbakSbdDUvJq9ha8Xh/iPeShszE8ymuItL/NSOJEJw7W4uriULouRg2GmKFQ96zFoAjfAh4z+igDh1fCJCDcC5CjsV9LbsMoxQ/FNZAFcvOWXnQBUkVEGmvkyoeIg8HfFmWv2Hes= daniellemurphy@Danielles-MacBook-Air.local"
      + tags_all        = (known after apply)
    }

  # aws_route.default_route will be created
  + resource "aws_route" "default_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.mtc_public_rt will be created
  + resource "aws_route_table" "mtc_public_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dev_public_rt"
        }
      + tags_all         = {
          + "Name" = "dev_public_rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.mtc_public_assoc will be created
  + resource "aws_route_table_association" "mtc_public_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.mtc_sg will be created
  + resource "aws_security_group" "mtc_sg" {
      + arn                    = (known after apply)
      + description            = "public security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "public_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.mtc_public_subnet will be created
  + resource "aws_subnet" "mtc_public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.123.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-public"
        }
      + tags_all                                       = {
          + "Name" = "dev-public"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.mtc_vpc will be created
  + resource "aws_vpc" "mtc_vpc" {
      + arn                            = (known after apply)
      + cidr_block                     = "10.123.0.0/16"
      + default_network_acl_id         = (known after apply)
      + default_route_table_id         = (known after apply)
      + default_security_group_id      = (known after apply)
      + dhcp_options_id                = (known after apply)
      + enable_classiclink             = (known after apply)
      + enable_classiclink_dns_support = (known after apply)
      + enable_dns_hostnames           = true
      + enable_dns_support             = true
      + id                             = (known after apply)
      + instance_tenancy               = "default"
      + ipv6_association_id            = (known after apply)
      + ipv6_cidr_block                = (known after apply)
      + main_route_table_id            = (known after apply)
      + owner_id                       = (known after apply)
      + tags                           = {
          + "Name" = "dev2"
        }
      + tags_all                       = {
          + "Name" = "dev2"
        }
    }

  # null_resource.delay will be created
  + resource "null_resource" "delay" {
      + id = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dev_ip = (known after apply)
[01HGDN76QHK92ZDA5ZBYGSGJQZ] Changes are GO
[01HGDN76QHK92ZDA5ZBYGSGJQZ] Uploading the list of managed resources...
[01HGDN76QHK92ZDA5ZBYGSGJQZ] Please be aware that the run changes calculation includes output changes.
[01HGDN76QHK92ZDA5ZBYGSGJQZ] Resource list upload is GO
[01HGDN76QHK92ZDA5ZBYGSGJQZ] Generating JSON representation of the plan...
[01HGDN76QHK92ZDA5ZBYGSGJQZ] JSON representation is GO
[01HGDN76QHK92ZDA5ZBYGSGJQZ] Loading custom plan policy inputs...
[01HGDN76QHK92ZDA5ZBYGSGJQZ] 0 custom plan policy inputs found
[01HGDN76QHK92ZDA5ZBYGSGJQZ] No plan policies to evaluate
```

</details>